{"config": [{"class_name": "Reshape", "config": {"input_dtype": "float32", "name": "reshape_3", "trainable": true, "batch_input_shape": [null, 32, 64], "target_shape": [32, 64, 1]}}, {"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa)C:/Users/Administrator/Desktop/3/model.py\u00da\b<lambda>1\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_3", "arguments": {}, "batch_input_shape": [null, 32, 64, 1], "trainable": true, "output_shape_type": "raw", "input_dtype": "float32", "function_type": "lambda", "output_shape": null}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "activation": "elu", "init": "glorot_uniform", "trainable": true, "W_constraint": null, "nb_filter": 8, "nb_row": 3, "activity_regularizer": null, "name": "convolution2d_9", "bias": true, "W_regularizer": null, "border_mode": "valid", "b_constraint": null, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1]}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "activation": "elu", "init": "glorot_uniform", "trainable": true, "W_constraint": null, "nb_filter": 12, "nb_row": 3, "activity_regularizer": null, "name": "convolution2d_10", "bias": true, "W_regularizer": null, "border_mode": "valid", "b_constraint": null, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [4, 4], "name": "maxpooling2d_5", "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "strides": [4, 4]}}, {"class_name": "Dropout", "config": {"name": "dropout_7", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "activation": "elu", "init": "glorot_uniform", "trainable": true, "W_constraint": null, "nb_filter": 16, "nb_row": 3, "activity_regularizer": null, "name": "convolution2d_11", "bias": true, "W_regularizer": null, "border_mode": "valid", "b_constraint": null, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1]}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "activation": "elu", "init": "glorot_uniform", "trainable": true, "W_constraint": null, "nb_filter": 16, "nb_row": 3, "activity_regularizer": null, "name": "convolution2d_12", "bias": true, "W_regularizer": null, "border_mode": "valid", "b_constraint": null, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "maxpooling2d_6", "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_8", "p": 0.5, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_3", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "linear", "output_dim": 128, "trainable": true, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "bias": true, "name": "dense_7", "init": "glorot_uniform", "b_constraint": null, "input_dim": 80}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "elu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_9", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "linear", "output_dim": 64, "trainable": true, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "bias": true, "name": "dense_8", "init": "glorot_uniform", "b_constraint": null, "input_dim": 128}}, {"class_name": "Activation", "config": {"name": "activation_6", "activation": "elu", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "linear", "output_dim": 1, "trainable": true, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "bias": true, "name": "dense_9", "init": "glorot_uniform", "b_constraint": null, "input_dim": 64}}], "keras_version": "1.2.1", "class_name": "Sequential"}